//変数設定
		
		//オーバーエンチャント関係
		const OE_no = ['HPアップ','ATKアップ','クリティカルアップ','被ダメージ軽減', 'EXアップ', '通常攻撃ラッシュ+1確率',
			'ユニゾンアタックダメージ倍率アップ', 'ランブルアタックダメージ倍率アップ', 
			'3体以上ユニゾン後行動CT短縮(1CT)', 'ランブル勝利時EX増加', 'チャージ攻撃時EX増加', '有利属性ダメージ倍率増加'];
		const OInV_no = [8,8,8,8,20,60,30,30,2,0,0,3.4];
		const OW_no = [0.6,0.6,0.6,0.6,1,2,13.5,13.5,1.8,3,1,1.58];
		const OD_no = [20,20,20,20,20,20,20,20,10,10,10,20];
		const OR_no = [
			[8.6,11,13.4,15.8,18.2],
			[8.6,11,13.4,15.8,18.2],
			[8.6,11,13.4,15.8,18.2],
			[8.6,11,13.4,15.8,18.2],
			[21,25,29,33,37],
			[62,70,78,86,94],
			[43.5,97.5,151.5,205.5,259.5],
			[43.5,97.5,151.5,205.5,259.5],
			[3.8,7.4,11,14.6,18.2],
			[3,9,15,21,27],
			[1,3,5,7,9],
			[4.98,11.3,17.62,23.94,30.26]
			];
		const OE_atk = ['クリティカルダメージ倍率アップ','相手スタン時ダメージ倍率アップ'];
		const OInV_atk = [5, 5];
		const OW_atk = [2.25, 2.25];
		const OD_atk = [20, 20];
		const OR_atk = [
			[7.25, 16.25, 25.25, 34.25, 43.25],
			[7.25, 16.25, 25.25, 34.25, 43.25]			
			];
		const OE_spd = ['行動CT最速値抽選','出撃時ラッシュ数増加'];
		const OInV_spd = [40, 0];
		const OW_spd = [3, 1];
		const OD_spd = [20, 10];
		const OR_spd = [
			[43, 55, 67, 79, 91],
			[1, 3, 5, 7, 9]			
			];
		const OE_def = ['被ダメージ時EX増加','被ダメージ時ATKアップ(20CT)'];
		const OInV_def = [0, 6];
		const OW_def = [1, 2.7];
		const OD_def = [20, 20];
		const OR_def = [
			[1, 5, 9, 13, 17],
			[7.25, 16.25, 25.25, 34.25, 43.25]			
			];
		const OE_sup = ['EXスキル消費EX量減少','ユニゾンアタック時EX増加'];
		const OInV_sup = [0, 5];
		const OW_sup = [1, 1];
		const OD_sup = [10, 10];
		const OR_sup = [
			[1, 3, 5, 7, 9],
			[6, 8, 10, 12, 14]			
			];
		const OE_heal = ['出撃時オーバーヒール(自基礎HP参照)','ユニゾンアタック時HP回復(自基礎HP参照)'];
		const OInV_heal = [15, 6];
		const OW_heal = [6.75, 2.7];
		const OD_heal = [20, 20];
		const OR_heal = [
			[21.75, 48.75, 75.75, 102.75, 129.75],
			[8.7, 19.5, 30.3, 41.1, 51.9]			
			];

		let l1 = 0
		let OE = OE_no.concat(OE_atk);
		let OInV = OInV_no.concat(OInV_atk);
		let OW = OW_no.concat(OW_atk);
		let OD = OD_no.concat(OD_atk);
		let OR = OR_no.concat(OR_atk);

		//エンチャント関係
		const E = ['HPアップ','ATKアップ','クリティカルアップ','被ダメージ軽減', 'EXアップ', '通常攻撃ラッシュ+1確率'];
		const InV = [2,2,2,2,8,40];
		const W = [0.6,0.6,0.6,0.6,1,2];
		const D = [20,20,20,20,20,20];
		const R = [
			[2.6,5,7.4,9.8,12.2],
			[2.6,5,7.4,9.8,12.2],
			[2.6,5,7.4,9.8,12.2],
			[2.6,5,7.4,9.8,12.2],
			[9,13,17,21,24],
			[42,50,58,66,72]
			];
		const com = ["012","013","014","015","023","024","025","034","035","045",
			"123","124","125","134","135","145","234","235","245","345"];
		
		let m = [100,100,100];
		let A = new Array(3);
		let B = new Array(3);
		let C = new Array(3);
		let tmp = new Array(4);

		//その他変数
		let n = 0;
		let j = 0;

				
